АлогистикТест2/src/Documents/алк_ТранспортировочныеПартии/алк_ТранспортировочныеПартии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ТранспортировочныеПартии</name>
  <registerRecords>AccumulationRegister.алк_ОборотыПроизводства</registerRecords>
  <registerRecords>InformationRegister.алк_ТранспортировчныеПартииПакетов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <registerRecords>AccumulationRegister.алк_ВыполнениеЗаказовЭтапыСерии</registerRecords>
  <registerRecords>InformationRegister.алк_ПартииТранспортировок</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПредварительныеПартииСерии</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>DefinedType.алк_Количество</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтветственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛЦ_Загрузка</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛЦ_Назначение</name>
    <type>
      <types>CatalogRef.алк_ЛогистическиеЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЭкспедитор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Мультизаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеЗапасыСвернуто</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Факт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПогрузки</name>
    <type>
      <types>DocumentRef.алк_ПогрузкаСудовыхПартий</types>
    </type>
  </attributes>
  <attributes>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.алк_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиницаПолучатель</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокНомеклатурыДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Теплоход</name>
    <type>
      <types>CatalogRef.алк_Теплоходы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьВ_ТД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоносамента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыТранспортировки</name>
    <attributes>
      <name>Транспортировка</name>
      <type>
        <types>DocumentRef.алк_ТранспортировкаЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемТаможня</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСостав</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.алк_ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Исключен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБруттоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыНоменклатуры</name>
    <attributes>
      <name>ВидНоменклатуры</name>
      <type>
        <types>CatalogRef.КатегорииНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Catalogs/СерийныеНомера/СерийныеНомера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерийныеНомера</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>Продан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКиЗГИСМ</name>
    <type>
      <types>DefinedType.НомерКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDTID</name>
    <type>
      <types>DefinedType.RFIDTID</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDUser</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RFIDEPC</name>
    <type>
      <types>DefinedType.RFIDEPC</types>
    </type>
  </attributes>
  <attributes>
    <name>EPCGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГИСМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НовыйМеханизмУчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Documents/алк_ТранспортировочныеПартии/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриИзмененииЗаказа();
	//ТолькоПросмотр = Объект.Факт;
	
	МассивСписка = Новый Массив;
	Для каждого стр Из Объект.ВидыНоменклатуры Цикл
		МассивСписка.Добавить(стр.ВидНоменклатуры);	
	КонецЦикла; 
	СписокНоменклатуры.ЗагрузитьЗначения(МассивСписка);
	
	УстановитьУсловноеОформлениеФормы(); 
	УстановитьТипЗаказаОбъекта();
	Если Не ЗначениеЗаполнено(Объект.Ссылка) тогда
		Объект.Дата = ТекущаяДата();
		РфпРаботаСДокументами.ПриИзмененииДатыДокумента(Объект, Объект.Дата); 		
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаПриИзменении(Элемент) 
	
	УстановитьСмену();   
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСмену() 
	
	//Заполним ДатаСмены и Смена автоматом
	Если ЗначениеЗаполнено(Объект.Участок) Тогда
		ПараметрыСменыПоТекущейДате = РфпПолучениеДанныхСервер.ПолучитьПараметрыСменыПоДате(Объект.Участок, Объект.Дата);
		ЗаполнитьЗначенияСвойств(Объект, ПараметрыСменыПоТекущейДате, "ДатаСмены, Смена");
	КонецЕсли;    
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюПечать);
	// Конец СтандартныеПодсистемы.Печать
	
	УправлениеНебольшойФирмойСервер.УстановитьОтображаниеПодменюПечати(Элементы.ПодменюПечать);
	
	ЗаполнитьЗапасыСвернутоНаСервере();
	//ДокОбъект = РеквизитФормыВЗначение("Объект");
	//
	//Таблица = ДокОбъект.ХранилищеЗапасыСвернуто.Получить();
	//Если Таблица <> Неопределено И ТипЗнч(Таблица) = Тип("ТаблицаЗначений") Тогда
	//	ЗапасыСвернуто.Загрузить(Таблица);
	//КонецЕсли; 
	Если ЗначениеЗаполнено(Объект.Участок) тогда
		ИспользоватьАддендумы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Участок, "ИспользуютсяАддендумы");
	КонецЕсли;	
	
	
	//Массив = Новый Массив(); 
	//Массив.Добавить(Тип("ДокументСсылка.алк_ЗаказПокупателя")); 
	//Описание = Новый ОписаниеТипов(Массив);
	//
	//Элементы.Заказ.ОграничениеТипа = Описание;

	//Если Не ЗначениеЗаполнено(Объект.Заказ) Тогда
	//	Объект.Заказ = Описание.ПривестиЗначение(Объект.Заказ);	
	//КонецЕсли;   	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Хранилище = Новый ХранилищеЗначения(ЗапасыСвернуто.Выгрузить());
	//ТекущийОбъект.ХранилищеЗапасыСвернуто = Хранилище;
	//ТекущийОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти 


#Область ОбработкаКоманд

&НаСервере
Процедура ЗаполнитьПоДокументамНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	алк_ТранспортировкаЗапасовЗапасы.СерийныйНомер,
	               |	алк_ТранспортировкаЗапасовЗапасы.Номенклатура,
	               |	алк_ТранспортировкаЗапасовЗапасы.Характеристика,
	               |	1 КАК КоличествоПакетов,
	               |	алк_ТранспортировкаЗапасовЗапасы.Объем,
	               |	алк_ТранспортировкаЗапасовЗапасы.ОбъемТаможня,
	               |	алк_ТранспортировкаЗапасовЗапасы.КоличествоСостав,
	               |	алк_ТранспортировкаЗапасовЗапасы.ВесНетто,
	               |	алк_ТранспортировкаЗапасовЗапасы.ВесБрутто,
	               |	алк_ТранспортировкаЗапасовЗапасы.Заказ,
	               |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВесБруттоПриВзвешиванииВПорту КАК ВесБруттоПриВзвешивании,
	               |	алк_ТранспортировкаЗапасовЗапасы.Ссылка КАК Транспортировка,
	               |	алк_ТранспортировкаЗапасовЗапасы.Ссылка.ВесБруттоПриВзвешиванииВПорту,
	               |	алк_ТранспортировкаЗапасовЗапасы.ВесНеттоПорт,
	               |	алк_ТранспортировкаЗапасовЗапасы.ВесБруттоПорт,
	               |	алк_ТранспортировкаЗапасовЗапасы.Сертификат
	               |ПОМЕСТИТЬ Вт_Транспортировка
	               |ИЗ
	               |	Документ.алк_ТранспортировкаЗапасов.Запасы КАК алк_ТранспортировкаЗапасовЗапасы
	               |ГДЕ
	               |	алк_ТранспортировкаЗапасовЗапасы.Ссылка В(&Ссылка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СУММА(Вт_Транспортировка.ВесБрутто) КАК ВесБрутто,
	               |	Вт_Транспортировка.Транспортировка,
	               |	Вт_Транспортировка.ВесБруттоПриВзвешивании
	               |ПОМЕСТИТЬ Вт_Итоги
	               |ИЗ
	               |	Вт_Транспортировка КАК Вт_Транспортировка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Вт_Транспортировка.Транспортировка,
	               |	Вт_Транспортировка.ВесБруттоПриВзвешивании
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Вт_Транспортировка.Номенклатура,
	               |	Вт_Транспортировка.Характеристика,
	               |	Вт_Транспортировка.КоличествоПакетов,
	               |	Вт_Транспортировка.Объем,
	               |	Вт_Транспортировка.ОбъемТаможня,
	               |	Вт_Транспортировка.КоличествоСостав,
	               |	ВЫБОР
	               |		КОГДА Вт_Транспортировка.ВесНеттоПорт = 0
	               |			ТОГДА Вт_Транспортировка.ВесНетто
	               |		ИНАЧЕ Вт_Транспортировка.ВесНеттоПорт
	               |	КОНЕЦ КАК ВесНеттоФакт,
	               |	ВЫБОР
	               |		КОГДА Вт_Транспортировка.ВесБруттоПорт = 0
	               |			ТОГДА Вт_Транспортировка.ВесБрутто
	               |		ИНАЧЕ Вт_Транспортировка.ВесБруттоПорт
	               |	КОНЕЦ КАК ВесБруттоФакт,
	               |	Вт_Транспортировка.Заказ,
	               |	Вт_Транспортировка.ВесНетто КАК ВесНетто,
	               |	Вт_Транспортировка.ВесБрутто КАК ВесБрутто,
	               |	Вт_Транспортировка.СерийныйНомер,
	               |	Вт_Транспортировка.ВесБруттоПриВзвешиванииВПорту КАК ВесБруттоПриВзвешиванииВПорту,
	               |	Вт_Транспортировка.ВесБрутто - Вт_Транспортировка.ВесНетто КАК ВесУпаковки,
	               |	Вт_Транспортировка.Транспортировка КАК Ссылка,
	               |	Вт_Транспортировка.Сертификат
	               |ИЗ
	               |	Вт_Транспортировка КАК Вт_Транспортировка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			Вт_Итоги.Транспортировка КАК Транспортировка,
	               |			ВЫБОР
	               |				КОГДА Вт_Итоги.ВесБрутто > 0
	               |						И Вт_Итоги.ВесБруттоПриВзвешивании > 0
	               |					ТОГДА Вт_Итоги.ВесБруттоПриВзвешивании / Вт_Итоги.ВесБрутто
	               |				ИНАЧЕ 1
	               |			КОНЕЦ КАК Коэффициент,
	               |			Вт_Транспортировка.СерийныйНомер КАК СерийныйНомер
	               |		ИЗ
	               |			Вт_Итоги КАК Вт_Итоги
	               |				ЛЕВОЕ СОЕДИНЕНИЕ Вт_Транспортировка КАК Вт_Транспортировка
	               |				ПО Вт_Итоги.Транспортировка = Вт_Транспортировка.Транспортировка) КАК ВложенныйЗапрос
	               |		ПО Вт_Транспортировка.СерийныйНомер = ВложенныйЗапрос.СерийныйНомер
	               |ИТОГИ
	               |	СУММА(ВесНеттоФакт),
	               |	СУММА(ВесБруттоФакт),
	               |	СУММА(ВесНетто),
	               |	СУММА(ВесБрутто),
	               |	МАКСИМУМ(ВесБруттоПриВзвешиванииВПорту)
	               |ПО
	               |	ОБЩИЕ,
	               |	Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ДокументыТранспортировки.Выгрузить(,"Транспортировка"));
	
	РезультатИтог = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Объект.Запасы.Очистить();
	
	РезультатИтог.Следующий();  
	
	ВесБруттоПриВзвешиванииВПорту 	= РезультатИтог.ВесБруттоПриВзвешиванииВПорту;
	ВесБруттоФактИтого 				= РезультатИтог.ВесБруттоФакт;
	
	Дельта = ВесБруттоПриВзвешиванииВПорту - ВесБруттоФактИтого;
	РезультатСсылка = РезультатИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока РезультатСсылка.Следующий() цикл 
		Результат = РезультатСсылка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока Результат.Следующий() цикл
			
			СтрТЧ = Объект.Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрТЧ,Результат);
						
		КонецЦикла;
	КонецЦикла;
			
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДокументам(Команда)
	
	//очищаем табличную часть
	Объект.Запасы.Очистить();
	//\\
	
	//Проверям заполненность документов
	Если Объект.ДокументыТранспортировки.Количество() = 0 Тогда
		Сообщить("Необходимо добавить транспортировки во вкладку ""Документы транспортировки запасов""!");
		Возврат;
	КонецЕсли; 
	//\\
	
	МассивПустыхДокументовТранспортировок = Объект.ДокументыТранспортировки.НайтиСтроки(Новый Структура("Транспортировка",ПредопределенноеЗначение("Документ.алк_ТранспортировкаЗапасов.ПустаяСсылка")));
	//удаляем пустые строчки, если есть
	Если МассивПустыхДокументовТранспортировок.Количество() <> 0 Тогда
		Сообщить("Во вкладке ""Документы транспортировки запасов"" есть пустые строки, необходимо удалить или заполнить!");
		Возврат;
	КонецЕсли; 
	//\\
	
	МассивКлючей = Новый Массив;
	
	Для каждого стрДок Из Объект.ДокументыТранспортировки Цикл
		
		МассивКлючей.Добавить(стрДок.КлючСвязи);
		
	КонецЦикла; 
	
	МаксЭлемент = РфпОбщегоНазначенияКлиент.МаксимальныйЭлементМассива(МассивКлючей);
	
	МаксЭлемент = ?(МаксЭлемент = Неопределено, 0, МаксЭлемент.Значение);
	
	Для каждого стрДок Из Объект.ДокументыТранспортировки Цикл
		
		Если стрДок.КлючСвязи = 0 Тогда
			
			стрДок.КлючСвязи = МаксЭлемент + 1;
			МаксЭлемент = МаксЭлемент + 1;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ЗаполнитьПоДокументамНаСервере();
	ЗаполнитьЗапасыСвернутоНаСервере();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗапасыСвернутоНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Запасы.Номенклатура,
	|	Запасы.Характеристика,
	|	Запасы.СерийныйНомер,
	|	Запасы.КоличествоПакетов,
	|	Запасы.Объем,
	|	Запасы.ОбъемТаможня,
	|	Запасы.КоличествоСостав,
	|	Запасы.ВесНетто,
	|	Запасы.ВесБрутто
	|ПОМЕСТИТЬ втЗапасы
	|ИЗ
	|	&Запасы КАК Запасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	втЗапасы.Номенклатура,
	|	втЗапасы.Характеристика,
	|	СУММА(втЗапасы.КоличествоПакетов) КАК КоличествоПакетов,
	|	СУММА(втЗапасы.Объем) КАК Объем,
	|	СУММА(втЗапасы.ОбъемТаможня) КАК ОбъемТаможня,
	|	СУММА(втЗапасы.ВесНетто) КАК ВесНетто,
	|	СУММА(втЗапасы.ВесБрутто) КАК ВесБрутто,
	|	алк_ПараметрыХарактеристик.Порода,
	|	алк_ПараметрыХарактеристик.Сорт,
	|	алк_ПараметрыХарактеристик.Длина,
	|	алк_ПараметрыХарактеристик.Сечение,
	|	алк_ПараметрыХарактеристик.Влажность
	|ИЗ
	|	втЗапасы КАК втЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|		ПО втЗапасы.Характеристика = алк_ПараметрыХарактеристик.Характеристика
	|
	|СГРУППИРОВАТЬ ПО
	|	втЗапасы.Номенклатура,
	|	втЗапасы.Характеристика,
	|	алк_ПараметрыХарактеристик.Порода,
	|	алк_ПараметрыХарактеристик.Сорт,
	|	алк_ПараметрыХарактеристик.Длина,
	|	алк_ПараметрыХарактеристик.Сечение,
	|	алк_ПараметрыХарактеристик.Влажность";
	
	Запрос.УстановитьПараметр("Запасы", Объект.Запасы.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	ЗапасыСвернуто.Загрузить(РезультатЗапроса.Выгрузить());	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЗапасыСвернуто(Команда)
	
	ЗаполнитьЗапасыСвернутоНаСервере();
	
КонецПроцедуры

#КонецОбласти 


#Область СобытияЭлементов

//////////////////////////////////////// ТЧ ДокументыТранспортировки 

&НаКлиенте
Процедура ДокументыТранспортировкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока ИЛИ Элемент.ТекущиеДанные.КлючСвязи = 0 Тогда
		
		МассивКлючей = Новый Массив;
		
		Для каждого стрДок Из Объект.ДокументыТранспортировки Цикл
			
			МассивКлючей.Добавить(стрДок.КлючСвязи);
			
		КонецЦикла; 
		
		МаксЭлемент = РфпОбщегоНазначенияКлиент.МаксимальныйЭлементМассива(МассивКлючей);
		
		Если МаксЭлемент <> Неопределено Тогда
			
			Элемент.ТекущиеДанные.КлючСвязи = МаксЭлемент.Значение + 1;
			
		Иначе
			
			Элемент.ТекущиеДанные.КлючСвязи = 1;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыТранспортировкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ДокументыТранспортировкиПриОкончанииРедактированияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДокументыТранспортировкиПриОкончанииРедактированияНаСервере()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	Объект.ОбъемДокумента = ДокОбъект.ПолучитьОбъемДокумента();
	
КонецПроцедуры



///////////////////////// Выбор видов номенклатуры из списка

&НаКлиенте
Процедура НаправлениеПриИзменении(Элемент)
	
	СписокНоменклатуры.Очистить();
	СинхронизироватьСписокИТаблицу();
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция СписокНоменклатурыНачалоВыбораНаСервере(СписокНоменклатуры, Направление)
	
	СписокДляВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КатегорииНоменклатуры.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА КатегорииНоменклатуры.Ссылка В (&СписокНоменклатуры)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Пометка
	|ИЗ
	|	Справочник.КатегорииНоменклатуры КАК КатегорииНоменклатуры
	|ГДЕ
	|	КатегорииНоменклатуры.Ссылка В(&КатегорииНаправления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	КатегорииНаправления = РфпПолучениеДанныхСервер.ПолучитьКатегорииНаправления(Направление);
	
	Запрос.УстановитьПараметр("КатегорииНаправления", КатегорииНаправления);
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();  //  РезультатЗапроса.Выгрузить()
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокДляВыбора.Добавить(ВыборкаДетальныеЗаписи.Ссылка,,ВыборкаДетальныеЗаписи.Пометка);		
	КонецЦикла;
	
	Возврат СписокДляВыбора;
	
	
КонецФункции

&НаКлиенте
Процедура СписокНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокДляВыбора = СписокНоменклатурыНачалоВыбораНаСервере(СписокНоменклатуры, Объект.Направление);
	Оповещение = Новый ОписаниеОповещения("ПослеОтметкиЭлементов", ЭтаФорма);
	СписокДляВыбора.ПоказатьОтметкуЭлементов(Оповещение, "Виды номенклатуры.");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтметкиЭлементов(СписокДляВыбора, Параметры) Экспорт
	
	Если СписокДляВыбора = Неопределено Тогда
		//Сообщить("Отказ от пометк.");
	Иначе
		СтарыйСписокНоменклатуры = СписокНоменклатуры.Скопировать();
		
		СписокНоменклатуры.Очистить();
		Для каждого Элемент Из СписокДляВыбора Цикл
			Если Элемент.Пометка Тогда
				СписокНоменклатуры.Добавить(Элемент.Значение);
			КонецЕсли;
		КонецЦикла;
		
		СписокУдаленных = Новый СписокЗначений;
		Для каждого стр Из СтарыйСписокНоменклатуры Цикл
			Если СписокНоменклатуры.НайтиПоЗначению(стр.Значение) = Неопределено Тогда
				СписокУдаленных.Добавить(стр.Значение);	
			КонецЕсли; 	
		КонецЦикла;
		
		ЛишниеСтроки = НеСоответствующиеСпискуВидов(СписокУдаленных);
		
		Если ЛишниеСтроки.Количество() > 0 Тогда
			СтрокиКУдалению = Новый Массив;
			Для каждого стрЛишниеСтроки Из ЛишниеСтроки Цикл
				СтрокиКУдалению.Добавить(стрЛишниеСтроки);	
			КонецЦикла; 
			
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ВопросЕстьЛишниеСтроки", ЭтаФорма);
			ПоказатьВопрос(Оповещение, "В табличной части ""Продукция"" имеются строки, с номенклатурой
			| не выбранной в списке ""Виды номенклатуры""." + Символы.ПС +
			"Удалить лишние строки?", Режим, 0, ,"");
		Иначе
			СтрокиКУдалению = Неопределено;
			СинхронизироватьСписокИТаблицу();
			
			Множественность = ?(СписокНоменклатуры.Количество()=1, Ложь, Истина);
			//НастроитьТаблицуПоСпискуНоменклатуры();
			
		КонецЕсли; 	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 


#Область Подбор

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)   
	
	
	ЗаполнитьТабличнуюЧастьСерийнымиНомерамиНаСервере(ВыбранноеЗначение);  
	
	ЗаполнитьЗапасыСвернутоНаСервере();
	
	Модифицированность = Истина;

	
	
	
	Возврат;
	
	
	
	ТабЧасть = Объект.ДокументыТранспортировки;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.алк_ТранспортировкаЗапасов") Тогда
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Транспортировка", ВыбранноеЗначение);
		МассивСтрок = ТабЧасть.НайтиСтроки(ПараметрыОтбора); 
		Если МассивСтрок.Количество() = 0 Тогда
			
			НоваяСтрока = ТабЧасть.Добавить();
			НоваяСтрока.Транспортировка = ВыбранноеЗначение;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура")
		и ВыбранноеЗначение.Свойство("АдресПодобранныхДанныхВХранилище") Тогда
		
		ЗагрузитьПодобранныеДанныеНаСервере(ВыбранноеЗначение.АдресПодобранныхДанныхВХранилище);
		
	КонецЕсли;

	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиБиблиотек

///////////////////////////////////////////////////// Подключаемые //////////////////////////////////////////////

// СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	// УНФ
	СтатистикаИспользованияФормКлиент.ДобавитьСтатистикуКомандПечати(ЭтотОбъект, Команда);
	// Конец УНФ
	
КонецПроцедуры


// Конец СтандартныеПодсистемы.Печать


#КонецОбласти 


#Область ОбщегоНазначения

&НаКлиенте
Функция НеСоответствующиеСпискуВидов(СписокЛишних)
	
	МассивЛишнихСтрок = Новый Массив;
	Для каждого стрЗапасы Из Объект.Запасы Цикл
		Если СписокЛишних.НайтиПоЗначению(стрЗапасы.Номенклатура) <> Неопределено Тогда
			МассивЛишнихСтрок.Добавить(стрЗапасы);	
		КонецЕсли; 	
	КонецЦикла; 
	Возврат МассивЛишнихСтрок;
	
КонецФункции

&НаКлиенте
Процедура СинхронизироватьСписокИТаблицу()	
	
	Объект.ВидыНоменклатуры.Очистить();
	Для каждого элт Из СписокНоменклатуры Цикл
		НовСтр = Объект.ВидыНоменклатуры.Добавить();
		НовСтр.ВидНоменклатуры = элт.Значение;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПодобранныеДанныеНаСервере(АдресВХранилище)
	
	ТаблицаЗначений = ПолучитьИзВременногоХранилища(АдресВХранилище);
	
	Для каждого Стр Из ТаблицаЗначений Цикл
		
		НовСтр = Объект.Запасы.Добавить();
		
		ПараметрыПакета = РфпПолучениеДанныхСервер.ПараметрыПакетаНоменклатурыПоСерийныйНомер(Стр.СерийныйНомер);
		ЗаполнитьЗначенияСвойств(НовСтр, ПараметрыПакета);
		
		НовСтр.Номенклатура = Стр.СерийныйНомер.Владелец;
		НовСтр.КоличествоПакетов = 1;
		
		НовСтр.ВесНетто  = ПараметрыПакета.ВесНеттоТаможня;
		НовСтр.ВесБрутто = ПараметрыПакета.ВесБруттоТаможня;
		
		//Отбор = Новый Структура();
		//Отбор.Вставить("Номенклатура", НовСтр.Номенклатура);
		//Отбор.Вставить("Характеристика", НовСтр.Характеристика);
		//Строки = ТаблицаАссортиментаЗаказа.НайтиСтроки(Отбор);
		//Если Строки.Количество() > 0 Тогда
		//	НовСтр.СоотвАссортиментуЗаказа = Истина;	
		//Иначе
		//	НовСтр.СоотвАссортиментуЗаказа = Ложь;
		//КонецЕсли;
		
	КонецЦикла;
	
	//ОбновитьИтоги(ЭтаФорма);
	
КонецПроцедуры // ЗагрузитьПодобранныеДанныеНаСервере()

#КонецОбласти 


Процедура Конец()
КонецПроцедуры

&НаКлиенте
Процедура ПодборПакетов(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Документ", Объект.Ссылка);
	ПараметрыФормы.Вставить("Склад", Объект.СтруктурнаяЕдиницаПолучатель);
	ПараметрыФормы.Вставить("Ячейка", ПредопределенноеЗначение("Справочник.Ячейки.ПустаяСсылка"));
	ПараметрыФормы.Вставить("СписокКатегорий", СписокНоменклатуры);
	
	ПараметрыФормы.Вставить("П1", 2); // Поменяем программно запрос в СписокПодбора(динамический список)
	
	ОткрытьФорму("Обработка.алк_ПодборПакетов.Форма.Форма", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//ТекущийОбъект.СписокНоменклатурыДокумента = "ОК";
	
КонецПроцедуры

// условия поставки
&НаКлиенте
Процедура УсловияПоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокДляВыбора = СписокУсловияПоставкиНаСервере();
	Оповещение = Новый ОписаниеОповещения("ПослеОтметкиЭлементовУсловияПоставки", ЭтаФорма);
	СписокДляВыбора.ПоказатьОтметкуЭлементов(Оповещение, "Условия поставки"); 
	
КонецПроцедуры

&НаСервере
Функция СписокУсловияПоставкиНаСервере()
	
	СписокДляВыбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_УсловияПоставки.Наименование КАК Наименование
	|ИЗ
	|	Справочник.алк_УсловияПоставки КАК алк_УсловияПоставки
	|ГДЕ
	|	НЕ алк_УсловияПоставки.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	                     			
	РезультатЗапроса = Запрос.Выполнить(); 	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокДляВыбора.Добавить(ВыборкаДетальныеЗаписи.Наименование,,);		
	КонецЦикла;
	
	Возврат СписокДляВыбора;
	
КонецФункции 

&НаКлиенте
Процедура ПослеОтметкиЭлементовУсловияПоставки(СписокДляВыбора, Параметры) Экспорт
	
	Если СписокДляВыбора <> Неопределено Тогда
		
		СписокУсловия = "";
		
		Для каждого Элемент Из СписокДляВыбора Цикл
			Если Элемент.Пометка Тогда
				СписокУсловия = СписокУсловия + Элемент.Значение + "; ";
			КонецЕсли;
		КонецЦикла;
		
		СписокУсловия = Сред(СписокУсловия, 1, СтрДлина(СписокУсловия) - 2);  		
		
		Объект.УсловияПоставки = СписокУсловия;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУсловияПоставкиНаСервере()
	
	Объект.УсловияПоставки = Объект.Заказ.УсловияПоставки.Описание;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУсловияПоставки(Команда)
	ЗаполнитьУсловияПоставкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДокументыТранспортировки1ТранспортировкаПриИзменении(Элемент)
	Если Объект.ДокументыТранспортировки.Количество() = 0 
		или Не ЗначениеЗаполнено(Объект.ДокументыТранспортировки[0].Транспортировка) тогда
		Объект.Заказ = ПредопределенноеЗначение("Документ.алк_ЗаказПокупателя.ПустаяСсылка");
	Иначе
		ДокументОснования = Объект.ДокументыТранспортировки[0].Транспортировка;
		Объект.Заказ = РфпПолучениеДанныхСервер.ЗначениеРеквизитаОбъекта(ДокументОснования, "Заказ");
	КонецЕсли;
	ПриИзмененииЗаказа();
	УстановитьУсловноеОформлениеФормы();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьУсловноеОформлениеФормы()
	
	Элементы.Направление.Видимость = Не ИспользоватьАддендумы;
	Элементы.СписокНоменклатуры.Видимость = Не ИспользоватьАддендумы;
	Элементы.ЗапасыПодборПакетов.Видимость = Не ИспользоватьАддендумы;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПриИзменении(Элемент)
	ПриИзмененииЗаказа();
	УстановитьУсловноеОформлениеФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЗаказа()
	
	ИспользоватьАддендумы = (ТипЗнч(Объект.Заказ) = Тип("ДокументСсылка.алк_Аддендумы"));
	
КонецПроцедуры


&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	
	ИспользоватьАддендумы = РфпПолучениеДанныхСервер.ЗначениеРеквизитаОбъекта(Объект.Участок, "ИспользуютсяАддендумы");
	УстановитьТипЗаказаОбъекта(Истина);
	УстановитьУсловноеОформлениеФормы();
	
	УстановитьСмену();
	
КонецПроцедуры

Процедура УстановитьТипЗаказаОбъекта(Принудительно = ложь)
	Если Не ЗначениеЗаполнено(Объект.Заказ) или Принудительно тогда
		Если ИспользоватьАддендумы тогда
			Объект.Заказ = ПредопределенноеЗначение("Документ.алк_Аддендумы.ПустаяСсылка");
		Иначе
			Объект.Заказ = ПредопределенноеЗначение("Документ.алк_ЗаказПокупателя.ПустаяСсылка");
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыТранспортировкиПриИзменении(Элемент) 
	
	ТекДанные = Элементы.ДокументыТранспортировки.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда 
		Объект.Участок = "";  
	Иначе 
		Если НЕ ЗначениеЗаполнено(ТекДанные.Транспортировка) Тогда 
			Объект.Участок = ПолучитьУчастокИзТранспортирвокиЗапасов(Объект.ДокументыТранспортировки[0].Транспортировка);
		Иначе
			Объект.Участок = ПолучитьУчастокИзТранспортирвокиЗапасов(ТекДанные.Транспортировка);	
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолучитьУчастокИзТранспортирвокиЗапасов(ТранспортировкаСсылка)
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	|	алк_ТранспортировкаЗапасов.Участок
	|ИЗ
	|	Документ.алк_ТранспортировкаЗапасов КАК алк_ТранспортировкаЗапасов
	|ГДЕ
	|	алк_ТранспортировкаЗапасов.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",ТранспортировкаСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Участок;
	КонецЦикла;
	Возврат "";	
КонецФункции



&НаКлиенте
Процедура ПодобратьПакеты(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора"		, Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("Организация"		, Объект.Организация);
	ПараметрыФормы.Вставить("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиницаПолучатель);
	Если ЗначениеЗаполнено(Объект.Заказ) тогда
		ПараметрыФормы.Вставить("Аддендум"			, Объект.Заказ);
	КонецЕсли;
	ПараметрыФормы.Вставить("ТолькоСОстатками"	, Истина);
	
	ОткрытьФорму("Справочник.СерийныеНомера.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры




&НаКлиенте
Процедура ПодобратьПакетыПоНомеру(Команда)
	ОткрытьФорму("Документ.алк_РасходнаяНакладная.Форма.ФормаПодбораПакетов", Новый структура("Аддендум, Участок, Склад, Дата, ЗакрыватьПриВыборе", Объект.Заказ, Объект.Участок, Объект.СтруктурнаяЕдиницаПолучатель, Объект.Дата, Ложь)
		, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры




&НаСервере
Процедура ЗаполнитьТабличнуюЧастьСерийнымиНомерамиНаСервере(МассивСсылок)
	
	Счетчик = МассивСсылок.Количество();  
	
	
	Пока Счетчик > 0 Цикл
		Счетчик = Счетчик - 1;
		ПараметрыОтбора = Новый структура("СерийныйНомер", МассивСсылок[Счетчик]);
		НайденныеСтроки = Объект.Запасы.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон("В табличной части %1 уже имеется серийный номер %2", Элементы.Запасы.Имя, МассивСсылок[Счетчик]),
				МассивСсылок[Счетчик], "Запасы", "Объект.Запасы");
			МассивСсылок.Удалить(Счетчик);	
		КонецЕсли;
	КонецЦикла;
	
	СтруктураСерийныхНомеров = РегистрыНакопления.алк_ОстаткиЗапасов.ПолучитьСтруктуруОстатковПакетов(МассивСсылок, Объект.Дата);
	
	Если СтруктураСерийныхНомеров.Количество() = 0 Тогда      	
		Сообщить("На дату документа пакета нет на остатках!"); 
		Возврат;
	КонецЕсли;  
	
	Для каждого СерийныйНомер из СтруктураСерийныхНомеров Цикл
		Для каждого ПараметрПакета из СерийныйНомер.МассивПараметров Цикл
			НовыйТовар = Объект.Запасы.Добавить();			
			ЗаполнитьЗначенияСвойств(НовыйТовар, ПолучитьПараметрыПакета(ПараметрПакета));			
			НовыйТовар.ВесНеттоФакт = НовыйТовар.ВесНетто;
			НовыйТовар.ВесБруттоФакт = НовыйТовар.ВесБрутто;  
			НовыйТовар.КоличествоПакетов = 1; 		
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры       


Функция ПолучитьПараметрыПакета(ПараметрПакета)  	
	
	Возврат РфпПолучениеДанныхСервер.ПолучитьПараметрыПакетаПоОстаткам(ПараметрПакета.СерийныйНомер); 	

КонецФункции
